foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration      | Version:  13                                  |
    \\  /    A nd           | Website:  https://openfoam.org                  |
     \\/     M anipulation   |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          44;
        startFace       1124;
    }

    interface
    {
        type            patch;
        nFaces          44;
        startFace       1168;
    }

    ground
    {
        type            patch;
        nFaces          76;
        startFace       1212;
    }

    side_left
    {
        type            patch;
        nFaces          76;
        startFace       1288;
    }

    top
    {
        type            patch;
        nFaces          76;
        startFace       1364;
    }

    side_right
    {
        type            patch;
        nFaces          76;
        startFace       1440;
    }

)

// ************************************************************************* //
