foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration      | Version:  13                                  |
    \\  /    A nd           | Website:  https://openfoam.org                  |
     \\/     M anipulation   |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            patch;
        nFaces          44;
        startFace       284;
    }

    interface
    {
        type            patch;
        nFaces          44;
        startFace       328;
    }

    side_right
    {
        type            patch;
        nFaces          16;
        startFace       372;
    }

    top
    {
        type            patch;
        nFaces          16;
        startFace       388;
    }

    ground
    {
        type            patch;
        nFaces          16;
        startFace       404;
    }

    side_left
    {
        type            patch;
        nFaces          16;
        startFace       420;
    }

)

// ************************************************************************* //
