foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/fluid/momentumTransport
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object momentumTransport;
}
simulationType laminar;
laminar
{
    model Stokes;
}
