foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/fluid/fluidProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}

rho 1000;
nu 1e-6;
fluidModel pimpleFluid;
pimpleFluidCoeffs
{
    ddtCorr true;
}
