foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/fsiProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}

fluidSolidInterface    IQNILS;
"IQNILSCoeffs"
{
    solidPatch              interface;
    fluidPatch              interface;
    predictor               yes;
    predictSolid            yes;
    relaxationFactor        0.1;
    outerCorrTolerance      1e-06;
    nOuterCorr              50;
    coupled                 yes;
    interfaceTransferMethod directMap;
    writeResidualsToFile    yes;
}
