foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/physicsProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicsProperties;
}

type fluidSolidInteraction;
