foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/constant/solid/solidProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}

solidModel     linearGeometryTotalDisplacement;
"linearGeometryTotalDisplacementCoeffs"
{
    solutionAlgorithm implicitSegregated;
    predictor         no;
}
