foampilot/tutorials/10_solids4foam_beamInCrossFlow/case/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            paraboloidInletVelocity;
        maxVelocity     0.3;
        yWidth          0.2;
        zWidth          0.4;
        timeVaryingEndTime 1.0;
        timeAtMaxVelocity 1.0;
        value           uniform (0 0 0);
    }
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side_left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side_right
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
